:PROPERTIES:
:ID:       cda3f6b5-af52-41a6-bbf3-c3b43c485cb2
:END:
#+TITLE: Linux: basics of elf binaries
#+CATEGORY: slips
#+TAGS:

* Org Babel from [[github.com:dfeich/org-babel-examples][dfeich/org-babel-examples]]

This guy's repository is seriously invaluable.

#+begin_src emacs-lisp
(require 'ob-C)
(add-to-list 'org-babel-load-languages '(C . t))

;;((emacs-lisp . t) (shell . t) (python . t))


#+end_src

  #+BEGIN_SRC C
    #include <stdlib.h>
    int main(int argc,char **argv) {
      printf("Hello World\n");
      exit(0);
    }
  #+END_SRC

  #+RESULTS:
  : Hello World

These are generated as temporary files. The [[https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-C.html][org-babel ob-C.el for C/C++ and D]]
doesn't seem to be too useful, but I've heard it can be. I'm not sure how to get
it to save the compilation artifacts.

It seems to be =15k= to print "Hello world\n" ... i guess because stdlib.h is statically linked.

#+begin_src sh
ls -al /tmp/babel-prSzrs/C-bin-OU5MgA
#+end_src

#+RESULTS:
: -rwx--x--x 1 dc dc 15472 Apr 25 00:04 /tmp/babel-prSzrs/C-bin-OU5MgA

** Elf mode and =readelf=

The =elf-mode= command in emacs just runs =readelf --syms -W=, which is
formatted nicely as a table.

#+begin_src sh
readelf --syms -W /tmp/babel-prSzrs/C-bin-OU5MgA
#+end_src

#+RESULTS:
|        |                  |           |          |        |          |     |                              |     |
| Symbol |            table | '.dynsym' | contains | 8      | entries: |     |                              |     |
|   Num: |            Value |      Size | Type     | Bind   | Vis      | Ndx | Name                         |     |
|     0: |                0 |         0 | NOTYPE   | LOCAL  | DEFAULT  | UND |                              |     |
|     1: |                0 |         0 | FUNC     | GLOBAL | DEFAULT  | UND | __libc_start_main@GLIBC_2.34 | (2) |
|     2: |                0 |         0 | NOTYPE   | WEAK   | DEFAULT  | UND | _ITM_deregisterTMCloneTable  |     |
|     3: |                0 |         0 | FUNC     | GLOBAL | DEFAULT  | UND | puts@GLIBC_2.2.5             | (3) |
|     4: |                0 |         0 | NOTYPE   | WEAK   | DEFAULT  | UND | __gmon_start__               |     |
|     5: |                0 |         0 | FUNC     | GLOBAL | DEFAULT  | UND | exit@GLIBC_2.2.5             | (3) |
|     6: |                0 |         0 | NOTYPE   | WEAK   | DEFAULT  | UND | _ITM_registerTMCloneTable    |     |
|     7: |                0 |         0 | FUNC     | WEAK   | DEFAULT  | UND | __cxa_finalize@GLIBC_2.2.5   | (3) |
|        |                  |           |          |        |          |     |                              |     |
| Symbol |            table | '.symtab' | contains | 25     | entries: |     |                              |     |
|   Num: |            Value |      Size | Type     | Bind   | Vis      | Ndx | Name                         |     |
|     0: |                0 |         0 | NOTYPE   | LOCAL  | DEFAULT  | UND |                              |     |
|     1: |                0 |         0 | FILE     | LOCAL  | DEFAULT  | ABS | C-src-z7ntgA.c               |     |
|     2: |                0 |         0 | FILE     | LOCAL  | DEFAULT  | ABS |                              |     |
|     3: | 0000000000003de0 |         0 | OBJECT   | LOCAL  | DEFAULT  | 21  | _DYNAMIC                     |     |
|     4: |             2010 |         0 | NOTYPE   | LOCAL  | DEFAULT  | 17  | __GNU_EH_FRAME_HDR           |     |
|     5: | 0000000000003fe8 |         0 | OBJECT   | LOCAL  | DEFAULT  | 23  | _GLOBAL_OFFSET_TABLE_        |     |
|     6: |                0 |         0 | FUNC     | GLOBAL | DEFAULT  | UND | __libc_start_main@GLIBC_2.34 |     |
|     7: |                0 |         0 | NOTYPE   | WEAK   | DEFAULT  | UND | _ITM_deregisterTMCloneTable  |     |
|     8: |             4010 |         0 | NOTYPE   | WEAK   | DEFAULT  | 24  | data_start                   |     |
|     9: |                0 |         0 | FUNC     | GLOBAL | DEFAULT  | UND | puts@GLIBC_2.2.5             |     |
|    10: |             4020 |         0 | NOTYPE   | GLOBAL | DEFAULT  | 24  | _edata                       |     |
|    11: |             1174 |         0 | FUNC     | GLOBAL | HIDDEN   | 15  | _fini                        |     |
|    12: |             4010 |         0 | NOTYPE   | GLOBAL | DEFAULT  | 24  | __data_start                 |     |
|    13: |                0 |         0 | NOTYPE   | WEAK   | DEFAULT  | UND | __gmon_start__               |     |
|    14: |             4018 |         0 | OBJECT   | GLOBAL | HIDDEN   | 24  | __dso_handle                 |     |
|    15: |             2000 |         4 | OBJECT   | GLOBAL | DEFAULT  | 16  | _IO_stdin_used               |     |
|    16: |             4028 |         0 | NOTYPE   | GLOBAL | DEFAULT  | 25  | _end                         |     |
|    17: |             1050 |        38 | FUNC     | GLOBAL | DEFAULT  | 14  | _start                       |     |
|    18: |             4020 |         0 | NOTYPE   | GLOBAL | DEFAULT  | 25  | __bss_start                  |     |
|    19: |             1149 |        40 | FUNC     | GLOBAL | DEFAULT  | 14  | =main=                       |     |
|    20: |                0 |         0 | FUNC     | GLOBAL | DEFAULT  | UND | exit@GLIBC_2.2.5             |     |
|    21: |             4020 |         0 | OBJECT   | GLOBAL | HIDDEN   | 24  | __TMC_END__                  |     |
|    22: |                0 |         0 | NOTYPE   | WEAK   | DEFAULT  | UND | _ITM_registerTMCloneTable    |     |
|    23: |                0 |         0 | FUNC     | WEAK   | DEFAULT  | UND | __cxa_finalize@GLIBC_2.2.5   |     |
|    24: |             1000 |         0 | FUNC     | GLOBAL | HIDDEN   | 12  | _init                        |     |


*** The "Canonical hex+ASCII" Hexdump

And here's the generated file:

#+begin_src sh :results verbatim
hexdump -C /tmp/babel-prSzrs/C-bin-OU5MgA
#+end_src

#+RESULTS:
#+begin_example
00000000  7f 45 4c 46 02 01 01 00  00 00 00 00 00 00 00 00  |.ELF............|
00000010  03 00 3e 00 01 00 00 00  50 10 00 00 00 00 00 00  |..>.....P.......|
00000020  40 00 00 00 00 00 00 00  f0 34 00 00 00 00 00 00  |@........4......|
00000030  00 00 00 00 40 00 38 00  0d 00 40 00 1e 00 1d 00  |....@.8...@.....|
00000040  06 00 00 00 04 00 00 00  40 00 00 00 00 00 00 00  |........@.......|
00000050  40 00 00 00 00 00 00 00  40 00 00 00 00 00 00 00  |@.......@.......|
00000060  d8 02 00 00 00 00 00 00  d8 02 00 00 00 00 00 00  |................|
00000070  08 00 00 00 00 00 00 00  03 00 00 00 04 00 00 00  |................|
00000080  18 03 00 00 00 00 00 00  18 03 00 00 00 00 00 00  |................|
00000090  18 03 00 00 00 00 00 00  1c 00 00 00 00 00 00 00  |................|
000000a0  1c 00 00 00 00 00 00 00  01 00 00 00 00 00 00 00  |................|
000000b0  01 00 00 00 04 00 00 00  00 00 00 00 00 00 00 00  |................|
000000c0  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
000000d0  68 06 00 00 00 00 00 00  68 06 00 00 00 00 00 00  |h.......h.......|
000000e0  00 10 00 00 00 00 00 00  01 00 00 00 05 00 00 00  |................|
000000f0  00 10 00 00 00 00 00 00  00 10 00 00 00 00 00 00  |................|
00000100  00 10 00 00 00 00 00 00  81 01 00 00 00 00 00 00  |................|
00000110  81 01 00 00 00 00 00 00  00 10 00 00 00 00 00 00  |................|
00000120  01 00 00 00 04 00 00 00  00 20 00 00 00 00 00 00  |......... ......|
00000130  00 20 00 00 00 00 00 00  00 20 00 00 00 00 00 00  |. ....... ......|
00000140  b0 00 00 00 00 00 00 00  b0 00 00 00 00 00 00 00  |................|
00000150  00 10 00 00 00 00 00 00  01 00 00 00 06 00 00 00  |................|
00000160  d0 2d 00 00 00 00 00 00  d0 3d 00 00 00 00 00 00  |.-.......=......|
00000170  d0 3d 00 00 00 00 00 00  50 02 00 00 00 00 00 00  |.=......P.......|
00000180  58 02 00 00 00 00 00 00  00 10 00 00 00 00 00 00  |X...............|
00000190  02 00 00 00 06 00 00 00  e0 2d 00 00 00 00 00 00  |.........-......|
000001a0  e0 3d 00 00 00 00 00 00  e0 3d 00 00 00 00 00 00  |.=.......=......|
000001b0  e0 01 00 00 00 00 00 00  e0 01 00 00 00 00 00 00  |................|
000001c0  08 00 00 00 00 00 00 00  04 00 00 00 04 00 00 00  |................|
000001d0  38 03 00 00 00 00 00 00  38 03 00 00 00 00 00 00  |8.......8.......|
000001e0  38 03 00 00 00 00 00 00  40 00 00 00 00 00 00 00  |8.......@.......|
000001f0  40 00 00 00 00 00 00 00  08 00 00 00 00 00 00 00  |@...............|
00000200  04 00 00 00 04 00 00 00  78 03 00 00 00 00 00 00  |........x.......|
00000210  78 03 00 00 00 00 00 00  78 03 00 00 00 00 00 00  |x.......x.......|
00000220  44 00 00 00 00 00 00 00  44 00 00 00 00 00 00 00  |D.......D.......|
00000230  04 00 00 00 00 00 00 00  53 e5 74 64 04 00 00 00  |........S.td....|
00000240  38 03 00 00 00 00 00 00  38 03 00 00 00 00 00 00  |8.......8.......|
00000250  38 03 00 00 00 00 00 00  40 00 00 00 00 00 00 00  |8.......@.......|
00000260  40 00 00 00 00 00 00 00  08 00 00 00 00 00 00 00  |@...............|
00000270  50 e5 74 64 04 00 00 00  10 20 00 00 00 00 00 00  |P.td..... ......|
00000280  10 20 00 00 00 00 00 00  10 20 00 00 00 00 00 00  |. ....... ......|
00000290  24 00 00 00 00 00 00 00  24 00 00 00 00 00 00 00  |$.......$.......|
000002a0  04 00 00 00 00 00 00 00  51 e5 74 64 06 00 00 00  |........Q.td....|
000002b0  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
,*
000002d0  00 00 00 00 00 00 00 00  10 00 00 00 00 00 00 00  |................|
000002e0  52 e5 74 64 04 00 00 00  d0 2d 00 00 00 00 00 00  |R.td.....-......|
000002f0  d0 3d 00 00 00 00 00 00  d0 3d 00 00 00 00 00 00  |.=.......=......|
00000300  30 02 00 00 00 00 00 00  30 02 00 00 00 00 00 00  |0.......0.......|
00000310  01 00 00 00 00 00 00 00  2f 6c 69 62 36 34 2f 6c  |......../lib64/l|
00000320  64 2d 6c 69 6e 75 78 2d  78 38 36 2d 36 34 2e 73  |d-linux-x86-64.s|
00000330  6f 2e 32 00 00 00 00 00  04 00 00 00 30 00 00 00  |o.2.........0...|
00000340  05 00 00 00 47 4e 55 00  02 80 00 c0 04 00 00 00  |....GNU.........|
00000350  01 00 00 00 00 00 00 00  01 00 01 c0 04 00 00 00  |................|
00000360  01 00 00 00 00 00 00 00  02 00 01 c0 04 00 00 00  |................|
00000370  00 00 00 00 00 00 00 00  04 00 00 00 14 00 00 00  |................|
00000380  03 00 00 00 47 4e 55 00  18 b9 40 27 eb a0 d5 27  |....GNU...@'...'|
00000390  f8 ea 9f cb 9f f4 07 45  3e 06 b3 d5 04 00 00 00  |.......E>.......|
000003a0  10 00 00 00 01 00 00 00  47 4e 55 00 00 00 00 00  |........GNU.....|
000003b0  04 00 00 00 04 00 00 00  00 00 00 00 00 00 00 00  |................|
000003c0  01 00 00 00 01 00 00 00  01 00 00 00 00 00 00 00  |................|
000003d0  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
,*
000003f0  00 00 00 00 00 00 00 00  0b 00 00 00 12 00 00 00  |................|
00000400  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00000410  4d 00 00 00 20 00 00 00  00 00 00 00 00 00 00 00  |M... ...........|
00000420  00 00 00 00 00 00 00 00  01 00 00 00 12 00 00 00  |................|
00000430  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00000440  69 00 00 00 20 00 00 00  00 00 00 00 00 00 00 00  |i... ...........|
00000450  00 00 00 00 00 00 00 00  06 00 00 00 12 00 00 00  |................|
00000460  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00000470  78 00 00 00 20 00 00 00  00 00 00 00 00 00 00 00  |x... ...........|
00000480  00 00 00 00 00 00 00 00  1d 00 00 00 22 00 00 00  |............"...|
00000490  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
000004a0  00 70 75 74 73 00 65 78  69 74 00 5f 5f 6c 69 62  |.puts.exit.__lib|
000004b0  63 5f 73 74 61 72 74 5f  6d 61 69 6e 00 5f 5f 63  |c_start_main.__c|
000004c0  78 61 5f 66 69 6e 61 6c  69 7a 65 00 6c 69 62 63  |xa_finalize.libc|
000004d0  2e 73 6f 2e 36 00 47 4c  49 42 43 5f 32 2e 32 2e  |.so.6.GLIBC_2.2.|
000004e0  35 00 47 4c 49 42 43 5f  32 2e 33 34 00 5f 49 54  |5.GLIBC_2.34._IT|
000004f0  4d 5f 64 65 72 65 67 69  73 74 65 72 54 4d 43 6c  |M_deregisterTMCl|
00000500  6f 6e 65 54 61 62 6c 65  00 5f 5f 67 6d 6f 6e 5f  |oneTable.__gmon_|
00000510  73 74 61 72 74 5f 5f 00  5f 49 54 4d 5f 72 65 67  |start__._ITM_reg|
00000520  69 73 74 65 72 54 4d 43  6c 6f 6e 65 54 61 62 6c  |isterTMCloneTabl|
00000530  65 00 00 00 02 00 01 00  03 00 01 00 03 00 01 00  |e...............|
00000540  03 00 00 00 00 00 00 00  01 00 02 00 2c 00 00 00  |............,...|
00000550  10 00 00 00 00 00 00 00  75 1a 69 09 00 00 03 00  |........u.i.....|
00000560  36 00 00 00 10 00 00 00  b4 91 96 06 00 00 02 00  |6...............|
00000570  42 00 00 00 00 00 00 00  d0 3d 00 00 00 00 00 00  |B........=......|
00000580  08 00 00 00 00 00 00 00  40 11 00 00 00 00 00 00  |........@.......|
00000590  d8 3d 00 00 00 00 00 00  08 00 00 00 00 00 00 00  |.=..............|
000005a0  f0 10 00 00 00 00 00 00  18 40 00 00 00 00 00 00  |.........@......|
000005b0  08 00 00 00 00 00 00 00  18 40 00 00 00 00 00 00  |.........@......|
000005c0  c0 3f 00 00 00 00 00 00  06 00 00 00 01 00 00 00  |.?..............|
000005d0  00 00 00 00 00 00 00 00  c8 3f 00 00 00 00 00 00  |.........?......|
000005e0  06 00 00 00 02 00 00 00  00 00 00 00 00 00 00 00  |................|
000005f0  d0 3f 00 00 00 00 00 00  06 00 00 00 04 00 00 00  |.?..............|
00000600  00 00 00 00 00 00 00 00  d8 3f 00 00 00 00 00 00  |.........?......|
00000610  06 00 00 00 06 00 00 00  00 00 00 00 00 00 00 00  |................|
00000620  e0 3f 00 00 00 00 00 00  06 00 00 00 07 00 00 00  |.?..............|
00000630  00 00 00 00 00 00 00 00  00 40 00 00 00 00 00 00  |.........@......|
00000640  07 00 00 00 03 00 00 00  00 00 00 00 00 00 00 00  |................|
00000650  08 40 00 00 00 00 00 00  07 00 00 00 05 00 00 00  |.@..............|
00000660  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
,*
00001000  f3 0f 1e fa 48 83 ec 08  48 8b 05 c1 2f 00 00 48  |....H...H.../..H|
00001010  85 c0 74 02 ff d0 48 83  c4 08 c3 00 00 00 00 00  |..t...H.........|
00001020  ff 35 ca 2f 00 00 ff 25  cc 2f 00 00 0f 1f 40 00  |.5./...%./....@.|
00001030  ff 25 ca 2f 00 00 68 00  00 00 00 e9 e0 ff ff ff  |.%./..h.........|
00001040  ff 25 c2 2f 00 00 68 01  00 00 00 e9 d0 ff ff ff  |.%./..h.........|
00001050  f3 0f 1e fa 31 ed 49 89  d1 5e 48 89 e2 48 83 e4  |....1.I..^H..H..|
00001060  f0 50 54 45 31 c0 31 c9  48 8d 3d da 00 00 00 ff  |.PTE1.1.H.=.....|
00001070  15 4b 2f 00 00 f4 66 2e  0f 1f 84 00 00 00 00 00  |.K/...f.........|
00001080  48 8d 3d 99 2f 00 00 48  8d 05 92 2f 00 00 48 39  |H.=./..H.../..H9|
00001090  f8 74 15 48 8b 05 2e 2f  00 00 48 85 c0 74 09 ff  |.t.H.../..H..t..|
000010a0  e0 0f 1f 80 00 00 00 00  c3 0f 1f 80 00 00 00 00  |................|
000010b0  48 8d 3d 69 2f 00 00 48  8d 35 62 2f 00 00 48 29  |H.=i/..H.5b/..H)|
000010c0  fe 48 89 f0 48 c1 ee 3f  48 c1 f8 03 48 01 c6 48  |.H..H..?H...H..H|
000010d0  d1 fe 74 14 48 8b 05 fd  2e 00 00 48 85 c0 74 08  |..t.H......H..t.|
000010e0  ff e0 66 0f 1f 44 00 00  c3 0f 1f 80 00 00 00 00  |..f..D..........|
000010f0  f3 0f 1e fa 80 3d 25 2f  00 00 00 75 33 55 48 83  |.....=%/...u3UH.|
00001100  3d da 2e 00 00 00 48 89  e5 74 0d 48 8b 3d 06 2f  |=.....H..t.H.=./|
00001110  00 00 ff 15 c8 2e 00 00  e8 63 ff ff ff c6 05 fc  |.........c......|
00001120  2e 00 00 01 5d c3 66 2e  0f 1f 84 00 00 00 00 00  |....].f.........|
00001130  c3 66 66 2e 0f 1f 84 00  00 00 00 00 0f 1f 40 00  |.ff...........@.|
00001140  f3 0f 1e fa e9 67 ff ff  ff 55 48 89 e5 48 83 ec  |.....g...UH..H..|
00001150  10 89 7d fc 48 89 75 f0  48 8d 05 a5 0e 00 00 48  |..}.H.u.H......H|
00001160  89 c7 e8 c9 fe ff ff bf  00 00 00 00 e8 cf fe ff  |................|
00001170  ff 00 00 00 f3 0f 1e fa  48 83 ec 08 48 83 c4 08  |........H...H...|
00001180  c3 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00001190  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
,*
00002000  01 00 02 00 48 65 6c 6c  6f 20 57 6f 72 6c 64 00  |....Hello World.|
00002010  01 1b 03 3b 24 00 00 00  03 00 00 00 10 f0 ff ff  |...;$...........|
00002020  58 00 00 00 40 f0 ff ff  40 00 00 00 39 f1 ff ff  |X...@...@...9...|
00002030  80 00 00 00 00 00 00 00  14 00 00 00 00 00 00 00  |................|
00002040  01 7a 52 00 01 78 10 01  1b 0c 07 08 90 01 00 00  |.zR..x..........|
00002050  14 00 00 00 1c 00 00 00  f8 ef ff ff 26 00 00 00  |............&...|
00002060  00 44 07 10 00 00 00 00  24 00 00 00 34 00 00 00  |.D......$...4...|
00002070  b0 ef ff ff 30 00 00 00  00 0e 10 46 0e 18 4a 0f  |....0......F..J.|
00002080  0b 77 08 80 00 3f 1a 3b  2a 33 24 22 00 00 00 00  |.w...?.;*3$"....|
00002090  18 00 00 00 5c 00 00 00  b1 f0 ff ff 28 00 00 00  |....\.......(...|
000020a0  00 41 0e 10 86 02 43 0d  06 00 00 00 00 00 00 00  |.A....C.........|
000020b0  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
,*
00002dd0  40 11 00 00 00 00 00 00  f0 10 00 00 00 00 00 00  |@...............|
00002de0  01 00 00 00 00 00 00 00  2c 00 00 00 00 00 00 00  |........,.......|
00002df0  0c 00 00 00 00 00 00 00  00 10 00 00 00 00 00 00  |................|
00002e00  0d 00 00 00 00 00 00 00  74 11 00 00 00 00 00 00  |........t.......|
00002e10  19 00 00 00 00 00 00 00  d0 3d 00 00 00 00 00 00  |.........=......|
00002e20  1b 00 00 00 00 00 00 00  08 00 00 00 00 00 00 00  |................|
00002e30  1a 00 00 00 00 00 00 00  d8 3d 00 00 00 00 00 00  |.........=......|
00002e40  1c 00 00 00 00 00 00 00  08 00 00 00 00 00 00 00  |................|
00002e50  f5 fe ff 6f 00 00 00 00  c0 03 00 00 00 00 00 00  |...o............|
00002e60  05 00 00 00 00 00 00 00  a0 04 00 00 00 00 00 00  |................|
00002e70  06 00 00 00 00 00 00 00  e0 03 00 00 00 00 00 00  |................|
00002e80  0a 00 00 00 00 00 00 00  92 00 00 00 00 00 00 00  |................|
00002e90  0b 00 00 00 00 00 00 00  18 00 00 00 00 00 00 00  |................|
00002ea0  15 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00002eb0  03 00 00 00 00 00 00 00  e8 3f 00 00 00 00 00 00  |.........?......|
00002ec0  02 00 00 00 00 00 00 00  30 00 00 00 00 00 00 00  |........0.......|
00002ed0  14 00 00 00 00 00 00 00  07 00 00 00 00 00 00 00  |................|
00002ee0  17 00 00 00 00 00 00 00  38 06 00 00 00 00 00 00  |........8.......|
00002ef0  07 00 00 00 00 00 00 00  78 05 00 00 00 00 00 00  |........x.......|
00002f00  08 00 00 00 00 00 00 00  c0 00 00 00 00 00 00 00  |................|
00002f10  09 00 00 00 00 00 00 00  18 00 00 00 00 00 00 00  |................|
00002f20  fb ff ff 6f 00 00 00 00  00 00 00 08 00 00 00 00  |...o............|
00002f30  fe ff ff 6f 00 00 00 00  48 05 00 00 00 00 00 00  |...o....H.......|
00002f40  ff ff ff 6f 00 00 00 00  01 00 00 00 00 00 00 00  |...o............|
00002f50  f0 ff ff 6f 00 00 00 00  32 05 00 00 00 00 00 00  |...o....2.......|
00002f60  f9 ff ff 6f 00 00 00 00  03 00 00 00 00 00 00 00  |...o............|
00002f70  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
,*
00002fe0  00 00 00 00 00 00 00 00  e0 3d 00 00 00 00 00 00  |.........=......|
00002ff0  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003000  36 10 00 00 00 00 00 00  46 10 00 00 00 00 00 00  |6.......F.......|
00003010  00 00 00 00 00 00 00 00  18 40 00 00 00 00 00 00  |.........@......|
00003020  47 43 43 3a 20 28 47 4e  55 29 20 31 32 2e 32 2e  |GCC: (GNU) 12.2.|
00003030  31 20 32 30 32 33 30 32  30 31 00 00 00 00 00 00  |1 20230201......|
00003040  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003050  00 00 00 00 00 00 00 00  01 00 00 00 04 00 f1 ff  |................|
00003060  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003070  00 00 00 00 04 00 f1 ff  00 00 00 00 00 00 00 00  |................|
00003080  00 00 00 00 00 00 00 00  10 00 00 00 01 00 15 00  |................|
00003090  e0 3d 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |.=..............|
000030a0  19 00 00 00 00 00 11 00  10 20 00 00 00 00 00 00  |......... ......|
000030b0  00 00 00 00 00 00 00 00  2c 00 00 00 01 00 17 00  |........,.......|
000030c0  e8 3f 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |.?..............|
000030d0  42 00 00 00 12 00 00 00  00 00 00 00 00 00 00 00  |B...............|
000030e0  00 00 00 00 00 00 00 00  5f 00 00 00 20 00 00 00  |........_... ...|
000030f0  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003100  9b 00 00 00 20 00 18 00  10 40 00 00 00 00 00 00  |.... ....@......|
00003110  00 00 00 00 00 00 00 00  7b 00 00 00 12 00 00 00  |........{.......|
00003120  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003130  8c 00 00 00 10 00 18 00  20 40 00 00 00 00 00 00  |........ @......|
00003140  00 00 00 00 00 00 00 00  93 00 00 00 12 02 0f 00  |................|
00003150  74 11 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |t...............|
00003160  99 00 00 00 10 00 18 00  10 40 00 00 00 00 00 00  |.........@......|
00003170  00 00 00 00 00 00 00 00  a6 00 00 00 20 00 00 00  |............ ...|
00003180  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003190  b5 00 00 00 11 02 18 00  18 40 00 00 00 00 00 00  |.........@......|
000031a0  00 00 00 00 00 00 00 00  c2 00 00 00 11 00 10 00  |................|
000031b0  00 20 00 00 00 00 00 00  04 00 00 00 00 00 00 00  |. ..............|
000031c0  d1 00 00 00 10 00 19 00  28 40 00 00 00 00 00 00  |........(@......|
000031d0  00 00 00 00 00 00 00 00  9f 00 00 00 12 00 0e 00  |................|
000031e0  50 10 00 00 00 00 00 00  26 00 00 00 00 00 00 00  |P.......&.......|
000031f0  d6 00 00 00 10 00 19 00  20 40 00 00 00 00 00 00  |........ @......|
00003200  00 00 00 00 00 00 00 00  e2 00 00 00 12 00 0e 00  |................|
00003210  49 11 00 00 00 00 00 00  28 00 00 00 00 00 00 00  |I.......(.......|
00003220  e7 00 00 00 12 00 00 00  00 00 00 00 00 00 00 00  |................|
00003230  00 00 00 00 00 00 00 00  f8 00 00 00 11 02 18 00  |................|
00003240  20 40 00 00 00 00 00 00  00 00 00 00 00 00 00 00  | @..............|
00003250  04 01 00 00 20 00 00 00  00 00 00 00 00 00 00 00  |.... ...........|
00003260  00 00 00 00 00 00 00 00  1e 01 00 00 22 00 00 00  |............"...|
00003270  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003280  39 01 00 00 12 02 0c 00  00 10 00 00 00 00 00 00  |9...............|
00003290  00 00 00 00 00 00 00 00  00 43 2d 73 72 63 2d 7a  |.........C-src-z|
000032a0  37 6e 74 67 41 2e 63 00  5f 44 59 4e 41 4d 49 43  |7ntgA.c._DYNAMIC|
000032b0  00 5f 5f 47 4e 55 5f 45  48 5f 46 52 41 4d 45 5f  |.__GNU_EH_FRAME_|
000032c0  48 44 52 00 5f 47 4c 4f  42 41 4c 5f 4f 46 46 53  |HDR._GLOBAL_OFFS|
000032d0  45 54 5f 54 41 42 4c 45  5f 00 5f 5f 6c 69 62 63  |ET_TABLE_.__libc|
000032e0  5f 73 74 61 72 74 5f 6d  61 69 6e 40 47 4c 49 42  |_start_main@GLIB|
000032f0  43 5f 32 2e 33 34 00 5f  49 54 4d 5f 64 65 72 65  |C_2.34._ITM_dere|
00003300  67 69 73 74 65 72 54 4d  43 6c 6f 6e 65 54 61 62  |gisterTMCloneTab|
00003310  6c 65 00 70 75 74 73 40  47 4c 49 42 43 5f 32 2e  |le.puts@GLIBC_2.|
00003320  32 2e 35 00 5f 65 64 61  74 61 00 5f 66 69 6e 69  |2.5._edata._fini|
00003330  00 5f 5f 64 61 74 61 5f  73 74 61 72 74 00 5f 5f  |.__data_start.__|
00003340  67 6d 6f 6e 5f 73 74 61  72 74 5f 5f 00 5f 5f 64  |gmon_start__.__d|
00003350  73 6f 5f 68 61 6e 64 6c  65 00 5f 49 4f 5f 73 74  |so_handle._IO_st|
00003360  64 69 6e 5f 75 73 65 64  00 5f 65 6e 64 00 5f 5f  |din_used._end.__|
00003370  62 73 73 5f 73 74 61 72  74 00 6d 61 69 6e 00 65  |bss_start.main.e|
00003380  78 69 74 40 47 4c 49 42  43 5f 32 2e 32 2e 35 00  |xit@GLIBC_2.2.5.|
00003390  5f 5f 54 4d 43 5f 45 4e  44 5f 5f 00 5f 49 54 4d  |__TMC_END__._ITM|
000033a0  5f 72 65 67 69 73 74 65  72 54 4d 43 6c 6f 6e 65  |_registerTMClone|
000033b0  54 61 62 6c 65 00 5f 5f  63 78 61 5f 66 69 6e 61  |Table.__cxa_fina|
000033c0  6c 69 7a 65 40 47 4c 49  42 43 5f 32 2e 32 2e 35  |lize@GLIBC_2.2.5|
000033d0  00 5f 69 6e 69 74 00 00  2e 73 79 6d 74 61 62 00  |._init...symtab.|
000033e0  2e 73 74 72 74 61 62 00  2e 73 68 73 74 72 74 61  |.strtab..shstrta|
000033f0  62 00 2e 69 6e 74 65 72  70 00 2e 6e 6f 74 65 2e  |b..interp..note.|
00003400  67 6e 75 2e 70 72 6f 70  65 72 74 79 00 2e 6e 6f  |gnu.property..no|
00003410  74 65 2e 67 6e 75 2e 62  75 69 6c 64 2d 69 64 00  |te.gnu.build-id.|
00003420  2e 6e 6f 74 65 2e 41 42  49 2d 74 61 67 00 2e 67  |.note.ABI-tag..g|
00003430  6e 75 2e 68 61 73 68 00  2e 64 79 6e 73 79 6d 00  |nu.hash..dynsym.|
00003440  2e 64 79 6e 73 74 72 00  2e 67 6e 75 2e 76 65 72  |.dynstr..gnu.ver|
00003450  73 69 6f 6e 00 2e 67 6e  75 2e 76 65 72 73 69 6f  |sion..gnu.versio|
00003460  6e 5f 72 00 2e 72 65 6c  61 2e 64 79 6e 00 2e 72  |n_r..rela.dyn..r|
00003470  65 6c 61 2e 70 6c 74 00  2e 69 6e 69 74 00 2e 74  |ela.plt..init..t|
00003480  65 78 74 00 2e 66 69 6e  69 00 2e 72 6f 64 61 74  |ext..fini..rodat|
00003490  61 00 2e 65 68 5f 66 72  61 6d 65 5f 68 64 72 00  |a..eh_frame_hdr.|
000034a0  2e 65 68 5f 66 72 61 6d  65 00 2e 69 6e 69 74 5f  |.eh_frame..init_|
000034b0  61 72 72 61 79 00 2e 66  69 6e 69 5f 61 72 72 61  |array..fini_arra|
000034c0  79 00 2e 64 79 6e 61 6d  69 63 00 2e 67 6f 74 00  |y..dynamic..got.|
000034d0  2e 67 6f 74 2e 70 6c 74  00 2e 64 61 74 61 00 2e  |.got.plt..data..|
000034e0  62 73 73 00 2e 63 6f 6d  6d 65 6e 74 00 00 00 00  |bss..comment....|
000034f0  00 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
,*
00003530  1b 00 00 00 01 00 00 00  02 00 00 00 00 00 00 00  |................|
00003540  18 03 00 00 00 00 00 00  18 03 00 00 00 00 00 00  |................|
00003550  1c 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003560  01 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003570  23 00 00 00 07 00 00 00  02 00 00 00 00 00 00 00  |#...............|
00003580  38 03 00 00 00 00 00 00  38 03 00 00 00 00 00 00  |8.......8.......|
00003590  40 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |@...............|
000035a0  08 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
000035b0  36 00 00 00 07 00 00 00  02 00 00 00 00 00 00 00  |6...............|
000035c0  78 03 00 00 00 00 00 00  78 03 00 00 00 00 00 00  |x.......x.......|
000035d0  24 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |$...............|
000035e0  04 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
000035f0  49 00 00 00 07 00 00 00  02 00 00 00 00 00 00 00  |I...............|
00003600  9c 03 00 00 00 00 00 00  9c 03 00 00 00 00 00 00  |................|
00003610  20 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  | ...............|
00003620  04 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003630  57 00 00 00 f6 ff ff 6f  02 00 00 00 00 00 00 00  |W......o........|
00003640  c0 03 00 00 00 00 00 00  c0 03 00 00 00 00 00 00  |................|
00003650  1c 00 00 00 00 00 00 00  06 00 00 00 00 00 00 00  |................|
00003660  08 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003670  61 00 00 00 0b 00 00 00  02 00 00 00 00 00 00 00  |a...............|
00003680  e0 03 00 00 00 00 00 00  e0 03 00 00 00 00 00 00  |................|
00003690  c0 00 00 00 00 00 00 00  07 00 00 00 01 00 00 00  |................|
000036a0  08 00 00 00 00 00 00 00  18 00 00 00 00 00 00 00  |................|
000036b0  69 00 00 00 03 00 00 00  02 00 00 00 00 00 00 00  |i...............|
000036c0  a0 04 00 00 00 00 00 00  a0 04 00 00 00 00 00 00  |................|
000036d0  92 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
000036e0  01 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
000036f0  71 00 00 00 ff ff ff 6f  02 00 00 00 00 00 00 00  |q......o........|
00003700  32 05 00 00 00 00 00 00  32 05 00 00 00 00 00 00  |2.......2.......|
00003710  10 00 00 00 00 00 00 00  06 00 00 00 00 00 00 00  |................|
00003720  02 00 00 00 00 00 00 00  02 00 00 00 00 00 00 00  |................|
00003730  7e 00 00 00 fe ff ff 6f  02 00 00 00 00 00 00 00  |~......o........|
00003740  48 05 00 00 00 00 00 00  48 05 00 00 00 00 00 00  |H.......H.......|
00003750  30 00 00 00 00 00 00 00  07 00 00 00 01 00 00 00  |0...............|
00003760  08 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003770  8d 00 00 00 04 00 00 00  02 00 00 00 00 00 00 00  |................|
00003780  78 05 00 00 00 00 00 00  78 05 00 00 00 00 00 00  |x.......x.......|
00003790  c0 00 00 00 00 00 00 00  06 00 00 00 00 00 00 00  |................|
000037a0  08 00 00 00 00 00 00 00  18 00 00 00 00 00 00 00  |................|
000037b0  97 00 00 00 04 00 00 00  42 00 00 00 00 00 00 00  |........B.......|
000037c0  38 06 00 00 00 00 00 00  38 06 00 00 00 00 00 00  |8.......8.......|
000037d0  30 00 00 00 00 00 00 00  06 00 00 00 17 00 00 00  |0...............|
000037e0  08 00 00 00 00 00 00 00  18 00 00 00 00 00 00 00  |................|
000037f0  a1 00 00 00 01 00 00 00  06 00 00 00 00 00 00 00  |................|
00003800  00 10 00 00 00 00 00 00  00 10 00 00 00 00 00 00  |................|
00003810  1b 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003820  04 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003830  9c 00 00 00 01 00 00 00  06 00 00 00 00 00 00 00  |................|
00003840  20 10 00 00 00 00 00 00  20 10 00 00 00 00 00 00  | ....... .......|
00003850  30 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |0...............|
00003860  10 00 00 00 00 00 00 00  10 00 00 00 00 00 00 00  |................|
00003870  a7 00 00 00 01 00 00 00  06 00 00 00 00 00 00 00  |................|
00003880  50 10 00 00 00 00 00 00  50 10 00 00 00 00 00 00  |P.......P.......|
00003890  21 01 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |!...............|
000038a0  10 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
000038b0  ad 00 00 00 01 00 00 00  06 00 00 00 00 00 00 00  |................|
000038c0  74 11 00 00 00 00 00 00  74 11 00 00 00 00 00 00  |t.......t.......|
000038d0  0d 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
000038e0  04 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
000038f0  b3 00 00 00 01 00 00 00  02 00 00 00 00 00 00 00  |................|
00003900  00 20 00 00 00 00 00 00  00 20 00 00 00 00 00 00  |. ....... ......|
00003910  10 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003920  04 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003930  bb 00 00 00 01 00 00 00  02 00 00 00 00 00 00 00  |................|
00003940  10 20 00 00 00 00 00 00  10 20 00 00 00 00 00 00  |. ....... ......|
00003950  24 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |$...............|
00003960  04 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003970  c9 00 00 00 01 00 00 00  02 00 00 00 00 00 00 00  |................|
00003980  38 20 00 00 00 00 00 00  38 20 00 00 00 00 00 00  |8 ......8 ......|
00003990  78 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |x...............|
000039a0  08 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
000039b0  d3 00 00 00 0e 00 00 00  03 00 00 00 00 00 00 00  |................|
000039c0  d0 3d 00 00 00 00 00 00  d0 2d 00 00 00 00 00 00  |.=.......-......|
000039d0  08 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
000039e0  08 00 00 00 00 00 00 00  08 00 00 00 00 00 00 00  |................|
000039f0  df 00 00 00 0f 00 00 00  03 00 00 00 00 00 00 00  |................|
00003a00  d8 3d 00 00 00 00 00 00  d8 2d 00 00 00 00 00 00  |.=.......-......|
00003a10  08 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003a20  08 00 00 00 00 00 00 00  08 00 00 00 00 00 00 00  |................|
00003a30  eb 00 00 00 06 00 00 00  03 00 00 00 00 00 00 00  |................|
00003a40  e0 3d 00 00 00 00 00 00  e0 2d 00 00 00 00 00 00  |.=.......-......|
00003a50  e0 01 00 00 00 00 00 00  07 00 00 00 00 00 00 00  |................|
00003a60  08 00 00 00 00 00 00 00  10 00 00 00 00 00 00 00  |................|
00003a70  f4 00 00 00 01 00 00 00  03 00 00 00 00 00 00 00  |................|
00003a80  c0 3f 00 00 00 00 00 00  c0 2f 00 00 00 00 00 00  |.?......./......|
00003a90  28 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |(...............|
00003aa0  08 00 00 00 00 00 00 00  08 00 00 00 00 00 00 00  |................|
00003ab0  f9 00 00 00 01 00 00 00  03 00 00 00 00 00 00 00  |................|
00003ac0  e8 3f 00 00 00 00 00 00  e8 2f 00 00 00 00 00 00  |.?......./......|
00003ad0  28 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |(...............|
00003ae0  08 00 00 00 00 00 00 00  08 00 00 00 00 00 00 00  |................|
00003af0  02 01 00 00 01 00 00 00  03 00 00 00 00 00 00 00  |................|
00003b00  10 40 00 00 00 00 00 00  10 30 00 00 00 00 00 00  |.@.......0......|
00003b10  10 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003b20  08 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003b30  08 01 00 00 08 00 00 00  03 00 00 00 00 00 00 00  |................|
00003b40  20 40 00 00 00 00 00 00  20 30 00 00 00 00 00 00  | @...... 0......|
00003b50  08 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003b60  01 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003b70  0d 01 00 00 01 00 00 00  30 00 00 00 00 00 00 00  |........0.......|
00003b80  00 00 00 00 00 00 00 00  20 30 00 00 00 00 00 00  |........ 0......|
00003b90  1b 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003ba0  01 00 00 00 00 00 00 00  01 00 00 00 00 00 00 00  |................|
00003bb0  01 00 00 00 02 00 00 00  00 00 00 00 00 00 00 00  |................|
00003bc0  00 00 00 00 00 00 00 00  40 30 00 00 00 00 00 00  |........@0......|
00003bd0  58 02 00 00 00 00 00 00  1c 00 00 00 06 00 00 00  |X...............|
00003be0  08 00 00 00 00 00 00 00  18 00 00 00 00 00 00 00  |................|
00003bf0  09 00 00 00 03 00 00 00  00 00 00 00 00 00 00 00  |................|
00003c00  00 00 00 00 00 00 00 00  98 32 00 00 00 00 00 00  |.........2......|
00003c10  3f 01 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |?...............|
00003c20  01 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003c30  11 00 00 00 03 00 00 00  00 00 00 00 00 00 00 00  |................|
00003c40  00 00 00 00 00 00 00 00  d7 33 00 00 00 00 00 00  |.........3......|
00003c50  16 01 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003c60  01 00 00 00 00 00 00 00  00 00 00 00 00 00 00 00  |................|
00003c70
#+end_example
* Roam
+ [[id:bdae77b1-d9f0-4d3a-a2fb-2ecdab5fd531][Linux]]
